%8.5
fprintf('8.5\n')
a=[3+2i 4;-i 1];
b=inv(a)*[2+i;3];
z1=b(1);
z2=b(2);
fprintf('解得z1=%d，z2=%d\n',z1,z2)

%9.4
fprintf('9.4\n')
%(a)
c=[0 2 5;2 1 1;3 1 0];
D=det(c);
fprintf('(a)行列式值為%d\n',D)
%(b)
D1=det([1 2 5;1 1 1;2 1 0]);
D2=det([0 1 5;2 1 1;3 2 0]);
D3=det([0 2 1;2 1 1;3 1 2]);
fprintf('(b)利用克拉莫法則求得x1=%d,x2=%d,x3=%d\n',D1/D,D2/D,D3/D)
%(c)
%部分軸元
d=[0 2 5 1;2 1 1 1;3 1 0 2];
d(1,:)=d(2,:);
d(2,:)=[0 2 5 1];
d(3,:)=d(3,:)-d(1,:)/d(1,1)*d(3,1);
d(3,:)=d(3,:)-d(2,:)/d(2,2)*d(3,2);
x3=d(3,4)/d(3,3);
x2=(d(2,4)-d(2,3)*x3)/d(2,2);
x1=(d(1,4)-d(1,3)*x3-d(1,2)*x2)/d(1,1);
e=[d(1,1:3);d(2,1:3);d(3,1:3)];%經過軸元運算以及高斯消去法後各項x係數的矩陣
D1=det(e);
fprintf('(c)行列式值為%d，因為採用部分軸元法將原本行列式第一、二列位置對換而使得行列式值會多一負號。\n',D1)
fprintf('利用軸元法求得x1=%d,x2=%d,x3=%d\n',x1,x2,x3)
%(d)
f=x1*c(1,1)+x2*c(1,2)+x3*c(1,3);
g=x1*c(2,1)+x2*c(2,2)+x3*c(2,3);
h=x1*c(3,1)+x2*c(3,2)+x3*c(3,3);
fprintf('(d)將(c)步驟中所求得的解代回原式發現第一、二、三條方程式的值分別為%d,%d,%d，符合方程組，故此解正確。\n',f,g,h)